In [315]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

In [442]:
%matplotlib inline

In [1029]:
df = pd.read_csv('test.csv')

In [1030]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Data Wrangling

## Title

In [1031]:
import re
patt = re.compile('\s(\S+\.)') # 1 whitespace character followed by several 
# non-whitespace characters followed by a dot

titles = np.array([re.search(patt, i)[1] for i in df['Name'].values])

print('Unique titles ({}): \n{}'.format(np.unique(titles).shape[0], np.unique(titles)))
print('')
print('Number of titles that are NaN/Null: {}'.format(pd.isnull(titles).sum()))

Unique titles (9):
['Col.' 'Dona.' 'Dr.' 'Master.' 'Miss.' 'Mr.' 'Mrs.' 'Ms.' 'Rev.']

Number of titles that are NaN/Null: 0

In [1032]:
df['Title'] =titles

In [1033]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr.
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Mrs.
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Mr.
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Mr.
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Mrs.

In [1034]:
df['Title'] = df['Title'].replace('Mlle.','Miss.')
df['Title'] = df['Title'].replace('Ms.','Miss.')  
df['Title'] =df['Title'].replace('Mme.','Mrs.')
df['Title'] = df['Title'].replace(['Capt.','Col.','Major.'],'Military.')
df['Title'] = df['Title'].replace(['Countess.','Don.','Jonkheer.','Lady.','Sir.'],'Noble.')

In [1035]:
df['Title'].unique()

array(['Mr.', 'Mrs.', 'Miss.', 'Master.', 'Military.', 'Rev.', 'Dr.',
       'Dona.'], dtype=object)

In [1036]:
print('Number of passengers:\n{}'.format(df['Title'].\
                                         groupby(df['Title']).size()))

Number of passengers:
Title
Dona.          1
Dr.            1
Master.       21
Military.      2
Miss.         79
Mr.          240
Mrs.          72
Rev.           2
Name: Title, dtype: int64

In [1037]:
print('Average survival:\n{}'.format(df[['Title','Survived']].\
                                     groupby(df['Title']).mean()))

KeyError: "['Survived'] not in index"

In [1038]:
df.drop('Name', axis=1, inplace=True)

## Ticket (Drop)

In [1039]:
DropColumns = ['Ticket']
df.drop(DropColumns, axis=1, inplace=True)

In [1040]:
df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Title
0,892,3,male,34.5,0,0,7.8292,NaN,Q,Mr.
1,893,3,female,47.0,1,0,7.0000,NaN,S,Mrs.
2,894,2,male,62.0,0,0,9.6875,NaN,Q,Mr.
3,895,3,male,27.0,0,0,8.6625,NaN,S,Mr.
4,896,3,female,22.0,1,1,12.2875,NaN,S,Mrs.

## Cabin Zone (First Letter)

In [1041]:
df['CabinZone']= df[~df['Cabin'].isnull()]['Cabin'].str[:1]

In [1042]:
df.loc[df['Cabin'].isnull(),'CabinZone']="None"

In [1043]:
DropColumns = ['Cabin']
df.drop(DropColumns, axis=1, inplace=True)

In [1044]:
df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,CabinZone
0,892,3,male,34.5,0,0,7.8292,Q,Mr.,None
1,893,3,female,47.0,1,0,7.0000,S,Mrs.,None
2,894,2,male,62.0,0,0,9.6875,Q,Mr.,None
3,895,3,male,27.0,0,0,8.6625,S,Mr.,None
4,896,3,female,22.0,1,1,12.2875,S,Mrs.,None

## PClass (Reverse value for ordering)

In [1045]:
df['Pclass'].isnull().any()

False

In [1046]:
df.loc[~df['Pclass'].isnull(),'OrderPclass']=2
df.loc[df['Pclass']==3,'OrderPclass']=1
df.loc[df['Pclass']==1,'OrderPclass']=3

In [1047]:
df['OrderPclass'].isnull().any()

False

In [1048]:
DropColumns = ['Pclass']
df.drop(DropColumns, axis=1, inplace=True)

In [1049]:
df.head()

,PassengerId,Sex,Age,SibSp,Parch,Fare,Embarked,Title,CabinZone,OrderPclass
0,892,male,34.5,0,0,7.8292,Q,Mr.,None,1.0
1,893,female,47.0,1,0,7.0000,S,Mrs.,None,1.0
2,894,male,62.0,0,0,9.6875,Q,Mr.,None,2.0
3,895,male,27.0,0,0,8.6625,S,Mr.,None,1.0
4,896,female,22.0,1,1,12.2875,S,Mrs.,None,1.0

### EDA - Fare (Binned)

In [1050]:
bins = np.append(np.arange(0,251,10),df['Fare'].max())
train_fare_binned = pd.cut(df['Fare'], bins, include_lowest=True)
df[['Survived']].groupby(train_fare_binned).mean()

print('Number of passengers:\n{}'.format(df[
    'Fare'].groupby(train_fare_binned).count()))
print('\n')
print('Average survival:\n{}'.format(df[
    'Survived'].groupby(train_fare_binned).mean()))

KeyError: "['Survived'] not in index"

## Handle N/A data

In [1051]:
df.columns[df.isna().any()].tolist()

['Age', 'Fare']

### Empty Age

In [1052]:
# # group by Sex, Pclass, and Title 
# grouped = df.groupby(['Sex','OrderPclass', 'Title'])  
# # view the median Age by the grouped features 
# grouped['Age'].median()

In [1053]:
# df.Age = grouped.Age.apply(lambda x: x.fillna(x.median()))

In [1054]:
df.head()

,PassengerId,Sex,Age,SibSp,Parch,Fare,Embarked,Title,CabinZone,OrderPclass
0,892,male,34.5,0,0,7.8292,Q,Mr.,None,1.0
1,893,female,47.0,1,0,7.0000,S,Mrs.,None,1.0
2,894,male,62.0,0,0,9.6875,Q,Mr.,None,2.0
3,895,male,27.0,0,0,8.6625,S,Mr.,None,1.0
4,896,female,22.0,1,1,12.2875,S,Mrs.,None,1.0

In [1055]:
df.loc[df['Age'].isnull() & (df['Sex']=='male'), 'Age'] = df.loc[df['Sex']=='male', 'Age'].median()
df.loc[df['Age'].isnull() & (df['Sex']=='female'), 'Age'] = df.loc[df['Sex']=='female', 'Age'].median()

In [1056]:
df.head()

,PassengerId,Sex,Age,SibSp,Parch,Fare,Embarked,Title,CabinZone,OrderPclass
0,892,male,34.5,0,0,7.8292,Q,Mr.,None,1.0
1,893,female,47.0,1,0,7.0000,S,Mrs.,None,1.0
2,894,male,62.0,0,0,9.6875,Q,Mr.,None,2.0
3,895,male,27.0,0,0,8.6625,S,Mr.,None,1.0
4,896,female,22.0,1,1,12.2875,S,Mrs.,None,1.0

### Fill Empty Embarkment

In [1057]:
# find most frequent Embarked value and store in variable
most_embarked = df['Embarked'].value_counts().index[0]

In [1058]:
most_embarked

'S'

In [1059]:
# fill NaN with most_embarked value
df['Embarked'] = df['Embarked'].fillna(most_embarked)

### Empty Fare

In [1060]:
df.loc[df['Fare'].isnull() & df['OrderPclass']==3 ,'Fare'] = df.loc[df['OrderPclass']==3,'Fare'].median()
df.loc[df['Fare'].isnull() & df['OrderPclass']==2 ,'Fare'] = df.loc[df['OrderPclass']==2,'Fare'].median()
df.loc[df['Fare'].isnull() & df['OrderPclass']==1 ,'Fare'] = df.loc[df['OrderPclass']==1,'Fare'].median()

In [1061]:
df.columns[df.isna().any()].tolist()

[]

In [1062]:
df.head()

,PassengerId,Sex,Age,SibSp,Parch,Fare,Embarked,Title,CabinZone,OrderPclass
0,892,male,34.5,0,0,7.8292,Q,Mr.,None,1.0
1,893,female,47.0,1,0,7.0000,S,Mrs.,None,1.0
2,894,male,62.0,0,0,9.6875,Q,Mr.,None,2.0
3,895,male,27.0,0,0,8.6625,S,Mr.,None,1.0
4,896,female,22.0,1,1,12.2875,S,Mrs.,None,1.0

# Feature Engineering

## Family Size

In [1063]:
df.head()

,PassengerId,Sex,Age,SibSp,Parch,Fare,Embarked,Title,CabinZone,OrderPclass
0,892,male,34.5,0,0,7.8292,Q,Mr.,None,1.0
1,893,female,47.0,1,0,7.0000,S,Mrs.,None,1.0
2,894,male,62.0,0,0,9.6875,Q,Mr.,None,2.0
3,895,male,27.0,0,0,8.6625,S,Mr.,None,1.0
4,896,female,22.0,1,1,12.2875,S,Mrs.,None,1.0

In [1064]:
df['FamilySize']=df['Parch']+df['SibSp']

In [1065]:
df['FamilySize'].unique()

array([ 0,  1,  2,  4,  3,  5,  7,  6, 10], dtype=int64)

In [1066]:
df.head()

,PassengerId,Sex,Age,SibSp,Parch,Fare,Embarked,Title,CabinZone,OrderPclass,FamilySize
0,892,male,34.5,0,0,7.8292,Q,Mr.,None,1.0,0
1,893,female,47.0,1,0,7.0000,S,Mrs.,None,1.0,1
2,894,male,62.0,0,0,9.6875,Q,Mr.,None,2.0,0
3,895,male,27.0,0,0,8.6625,S,Mr.,None,1.0,0
4,896,female,22.0,1,1,12.2875,S,Mrs.,None,1.0,2

## Dummies of Sex + Embarked + Title + CabinZone

In [1067]:
df = pd.get_dummies(df, columns=['Sex'])

In [1068]:
df = pd.get_dummies(df, columns=['Embarked'])

In [1069]:
df = pd.get_dummies(df,columns=['Title'])

In [1070]:
df = pd.get_dummies(df, columns=['CabinZone'])

In [1071]:
df.head()

,PassengerId,Age,SibSp,Parch,Fare,OrderPclass,FamilySize,Sex_female,Sex_male,Embarked_C,...,Title_Mrs.,Title_Rev.,CabinZone_A,CabinZone_B,CabinZone_C,CabinZone_D,CabinZone_E,CabinZone_F,CabinZone_G,CabinZone_None
0,892,34.5,0,0,7.8292,1.0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,1
1,893,47.0,1,0,7.0000,1.0,1,1,0,0,...,1,0,0,0,0,0,0,0,0,1
2,894,62.0,0,0,9.6875,2.0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,1
3,895,27.0,0,0,8.6625,1.0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,1
4,896,22.0,1,1,12.2875,1.0,2,1,0,0,...,1,0,0,0,0,0,0,0,0,1

# Compare Train VS Test data

In [1072]:
# train = df.copy()

In [1073]:
train.columns

Index(['PassengerId', 'Survived', 'Age', 'SibSp', 'Parch', 'Fare',
       'OrderPclass', 'FamilySize', 'Sex_female', 'Sex_male', 'Embarked_C',
       'Embarked_Q', 'Embarked_S', 'Title_Dr.', 'Title_Master.',
       'Title_Military.', 'Title_Miss.', 'Title_Mr.', 'Title_Mrs.',
       'Title_Noble.', 'Title_Rev.', 'CabinZone_A', 'CabinZone_B',
       'CabinZone_C', 'CabinZone_D', 'CabinZone_E', 'CabinZone_F',
       'CabinZone_G', 'CabinZone_None', 'CabinZone_T'],
      dtype='object')

In [1074]:
# For Test Data only
test = df.copy()
test.columns

Index(['PassengerId', 'Age', 'SibSp', 'Parch', 'Fare', 'OrderPclass',
       'FamilySize', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S', 'Title_Dona.', 'Title_Dr.', 'Title_Master.',
       'Title_Military.', 'Title_Miss.', 'Title_Mr.', 'Title_Mrs.',
       'Title_Rev.', 'CabinZone_A', 'CabinZone_B', 'CabinZone_C',
       'CabinZone_D', 'CabinZone_E', 'CabinZone_F', 'CabinZone_G',
       'CabinZone_None'],
      dtype='object')

In [1075]:
# Get missing columns in the training test
missing_cols = set( train.columns ) - set( test.columns )
# Add a missing column in test set with default value equal to 0
for c in missing_cols:
    test[c] = 0
# Ensure the order of column in the test set is in the same order than in train set
test = test[train.columns]

In [1077]:
DropColumns = ['Survived']
test.drop(DropColumns, axis=1, inplace=True)

In [1078]:
test.columns

Index(['PassengerId', 'Age', 'SibSp', 'Parch', 'Fare', 'OrderPclass',
       'FamilySize', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S', 'Title_Dr.', 'Title_Master.', 'Title_Military.',
       'Title_Miss.', 'Title_Mr.', 'Title_Mrs.', 'Title_Noble.', 'Title_Rev.',
       'CabinZone_A', 'CabinZone_B', 'CabinZone_C', 'CabinZone_D',
       'CabinZone_E', 'CabinZone_F', 'CabinZone_G', 'CabinZone_None',
       'CabinZone_T'],
      dtype='object')

# Save Prepared Data

In [1079]:
test.to_csv('preptestdata.csv',index = False)